swat-dp-tools/soma/xml/ping.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dp="http://www.datapower.com/schemas/management">
    <soapenv:Body>
        <dp:request xmlns:dp="http://www.datapower.com/schemas/management">
            <dp:do-action>
                <Ping>
                    <RemoteHost>@remote.host.name@</RemoteHost>
                </Ping>
            </dp:do-action>
        </dp:request>
    </soapenv:Body>
</soapenv:Envelope>
